/* Задача 1 Создать переменные num1, num2 которые пользователь вводит с клавиатуры
Проверьте, что переменная num1 равна или меньше 1, а переменная num2 больше или равна 3.
*/

/*let num1 = prompt ('Введите переменную 1');
let num2 = prompt ('Введите переменную 2');

if (num1 <= 1 && num2 >= 3) {
    console.log ('Переменная num1 равна или меньше 1, а переменная num2  больше или равна 3');
} else { 
    console.log ('Возможно переменные по условию задачи num1 должна быть либо равна либо меньше 1! а num2 либо больше либо равно 3');
}*/

/*Задание 2
Перепишите код к тернарному оператору*/

// let test = true;
// if (test === true) {
// console.log('+++');
// } else {
// console.log('---');
// }
// let test = true ? console.log('+++') : console.log('---');

// Задание 3
// В переменной day лежит какое-то число из интервала от 1 до 31. Определите в какую декаду месяца попадает 
// это число (в первую, вторую или третью).

// let day = prompt('Введите число месяца');
// let result = spacing(day);

// console.log(result);

// function spacing(day) {
    
//         if (day > 0 && day <= 11) { 
//             return String('1 декада');
//          }
//         else if (day >= 11 && day <= 21) { 
//             return String('2 декада');
//          }
//         else if (day >= 21 && day <= 31) {
//             return String('3 декада');
// }

// }
